<template>
  <div class="content-tpl eight-tpl">
    <h4>新博新美连锁营业员管理协议</h4>
    <div class="base-info">
      <p>甲方 <span class="s-value">{{tplData.partya}}</span></p>
      <p>乙方 <span class="s-value">{{tplData.partyb}}</span></p>
      <p>新博新美连锁商场为进一步实施商场统一营业员管理，提升新博新美连锁商场和商家的形象，双方制定如下约定，共同遵守：</p>
    </div>
    <div class="terms">
      <div v-for="item in itemData" :key="item.val">
        {{item.val}}
        <p v-if="item.sub" v-for="sub in item.sub" :key="sub">
          {{sub}}
        </p>
      </div>
    </div>
    <div class="sign-info">
      <p>甲方(盖章)</p>
      <p>乙方(盖章)</p>
      <p>授权代表</p>
      <p>授权代表</p>
      <p>日期 <label>{{tplData.date}}</label></p>
      <p>日期 <label>{{tplData.date}}</label></p>
    </div>
  </div>
</template>
<script>
  export default {
    props:['tplData'],
    data() {
      return {
        itemData:[
          {'val':'1、商家营业员须严格遵守商场制订的《营业员手册》和《服务行为规范管理制度》。'},
          {'val':'2、营业员上岗前需参加甲方统一培训，培训合格后，即可上岗。'},
          {'val':'3、乙方须向商场管理部提供营业员的数量和履历，以便商场管理部备案管理。对新增、调离、辞退的营业员须及时向商场管理部申报，以利于人员管理。'},
          {'val':'4、乙方营业员应自觉、主动接受甲方的管理和监督。'},
          {'val':'5、乙方须定期对营业员强调和培训《营业员手册》，对甲方实施处罚的营业员，乙方应积极协助甲方督促其改正。'},
          {'val':'6、乙方对甲方管理存有疑议时，须遵守甲方申诉程序，严格按甲方申诉程序进行申诉，严禁指责、诋毁、谩骂甲方工作人员。'},
          {'val':'7、甲方将向入场商家公布管理和监督工作人员名单，并公布管理和监督执行程序，同时欢迎乙方监督。'},
          {'val':'8、乙方须向甲方缴纳营业员管理基金，甲方用于营业员培训及其它费用，此基金每年结算一次。'},
          {
            'val':'9、乙方同意甲方按以下标准执行对营业员进行监督管理：',
            'sub':[
              '① 每日上、下班必须按时打卡（早上：9:20以前，下午6:00以后），不得代他人打卡。',
              '② 如休假或因公外出不能打卡，必须向楼层经理请假并出具假条。',
              '③ 每天早晨9:25在楼层指定位置参加早会，不得无故缺席，迟到。',
              '④ 会点名时，必须到达指定位置不得代他人签到。',
              '⑤ 班时间必须按规定着装、佩戴工作牌，如有特殊原因不能着装须向楼层经理汇报说明。',
              '⑥ 上班时间不得打堆、聊天、嬉戏、带小孩、打毛线、玩牌、下棋，不得吃零食，睡觉等。',
              '⑦ 使用规范的服务用语，不得在商场内高声喧哗、争吵、喊叫、吹口哨等。',
              '⑧ 维护商场环境卫生，不得随地吐痰、乱丢烟头，纸屑等，每日下班前清扫完营业场地内卫生。',
            ]
          },
          {
            'val':'处罚标准：',
            'sub':[
              '① 违反上述条例一次，处以警告处分并罚款10-50元。',
              '② 受到3次警告处分后,再发生警告处分按记过处分处理,并罚款100元-200元。',
              '③ 营业员受到3次记过处分后, 再发生记过处分，按停工处分，禁入商场处理。'
            ]
          }
        ]
      }
    },
    methods: {

    }
  };
</script>
<style lang="less" scoped>
  .eight-tpl{
    .base-info{
      p{
        width: 100% !important;
      }
      p:last-child{
        text-indent: 2em;
      }
    }
  }
</style>
