<template>
  <div class="content-tpl three-tpl">
    <h4>新博新美连锁商场统一收款合同书</h4>
    <div class="base-info">
      <p>甲方 <span class="s-value">{{tplData.partya}}</span></p>
      <p>乙方 <span class="s-value">{{tplData.partyb}}</span></p>
      <p>为进一步规范商场管理，为在本商场购物的顾客提供统一的售后服务，甲乙双方经友好协商，就在新博新美商场统一收银事宜达成如下约定，共同遵守。</p>
    </div>
    <div class="terms">
      <h5><span>一</span>统一收款程序</h5>
      <div v-for="item in receiptA" :key="item">
          {{item}}
      </div>
      <div>
        6、甲方根据以下银行卡信息，在约定时间内将统一收银款项支付乙方
        <p>银行名称<label>{{tplData.refundAccountBank}}</label></p>
        <p>开 户 人<label>{{tplData.refundAccountName}}</label></p>
        <p>银行卡号<label>{{tplData.refundAccountNumber}}</label></p>
        <p>若乙方返款账户发生变更的，需到财务部办理变更手续，变更完毕后按照新的银行卡进行返款。若因乙方提供的银行信息有误，造成支付错误的，一切责任由乙方承担。</p>
      </div>
      <div v-for="item in receiptB" :key="item">
        {{item}}
      </div>
      <h5><span>二</span>统一收银合同期限、销售量</h5>
      <div>1、本合同期限为年，同市场管理合同时间一致。自年月日起至年月日止。</div>
      <div>2、甲方收取乙方商场管理及商品质量保证金。若出现消费者质量投诉，甲方有权按照<< 新博新美连锁商场管理合同 >>相关条款启用“先行代赔”处理。</div>

      <h5><span>三</span>售后服务</h5>
      <div>1、乙方所售商品若出现质量问题，原则由乙方直接处理。</div>
      <div>2、乙方需遵守甲方的售后服务承诺。在规定的时间内解决消费者的商品质量投诉。</div>
      <div>3、乙方无故拖延消费者质量投诉解决，甲方有权动用乙方保证金实施解决，乙方须在3日内补足保证金，在规定时间内未补足保证金的，视为乙方违约，甲方有权终止合同，无偿收回经营场地并有权要求乙方赔偿损失。</div>
      <h5><span>四</span>甲方承诺</h5>
      <div>
        <p>甲方保证不向任何部门提供乙方销售的原始资料，以保证乙方利益。即甲方对乙方收银量实施保密。</p>
        <p>在合同约定的返款期内若因甲方原因未办理完乙方货款结算手续，延缓一日甲方按千分之二支付乙方利息。国家法定休息日顺延。但由于乙方账户因自身原因被有关权机构冻结、划转或因外部大范围长时间电力通讯中断等不可抗力原因所致的情况除外。</p>
        <p>乙方在使用POS机时,应遵守中国银联有关的操作规程执行,不套现和将POS机移离甲方指定的经营场所使用.且由此造成的后果均由乙方负责。如有违规违法的行为,根据相关法律法规进行处理。</p>
      </div>
      <h5><span>五</span>本合同一式二份，甲乙双方各执一份，双方签字盖章后生效。</h5>
    </div>
    <div class="sign-info">
      <p>甲方(盖章)</p>
      <p>乙方(盖章)</p>
      <p>授权代表</p>
      <p>授权代表</p>
      <p>日期 <label>{{tplData.date}}</label></p>
      <p>日期 <label>{{tplData.date}}</label></p>
    </div>
  </div>
</template>
<script>
  export default {
    props:['tplData'],
    data() {
      return {
        receiptA:[
          '1、甲方在商场总服务台及乙方经营场地内设置统一收银POS机，收取场内商品货款、订金等。',
          '2、乙方在销售商品时需按要求填写甲方统一印制的<<新博新美商场购物收款单>>四联单，甲方根据乙方填写的收款信息及收款金额收取款项，收款完成后在收款单上加盖新博新美统一刻制的收款专用章,乙方领取商户联做为返款凭证。若因乙方单据填写错误造收款错误的，由乙方承担全部责任。',
          '3、如消费者持<<新博新美商场购物收款单>>到总服务台交费，甲方收银员按乙方填写的<<新博新美商场购物收款单>>收取货款，并在<<新博新美商场购物收款单>>加盖新博新美统一刻制的收款专用章。同时开具收银小票两联。通过POS刷卡方式支付的，还需开具POS小票两联。甲方留存《新博新美商场购物单》商场财务留存联及商场留存联（白、蓝联）、收银小票商场存根联、POS小票商场存根联（仅限POS刷卡支付的）、优惠券（卡），用于记账及对账；乙方留存《新博新美商场购物单》供货商留存联（黄联），作为对账凭据；消费者留存《新博新美商场购物单》消费者留存联（红联）、收银小票消费者存根联、POS小票消费者存根联（仅限POS刷卡支付的），作为提货凭据。',
          '4、如消费者在乙方经营场地内交费的，由乙方自行收取货款。若乙方店内设有新博新美统一收银POS机的，且消费者通过POS刷卡方式进行交费的，乙方收款员需保留POS小票存根联，并填写《新博美连锁商家货款支付表》作为对账凭据。',
          '5、甲方代乙方收取的日常销售款项，甲方在次周的周四内返还乙方(节假日顺延)。甲方代乙方收取的活动销售款项，甲方在活动结束后10个工作日内返还乙方。乙方凭对账相关单据，在甲方通知的对账时间内，到财务部进行对账结算，对账无误后需签字确认。甲方财务根据确认无误并签字完毕的返款明细，在周四前以转账方式向乙方进行支付。若乙方未在甲方通知的时间内完成对账并造成返款时间滞后的，一切责任由乙方承担。',
        ],
        receiptB:[
          '7、消费者要求退货退款时，乙方开具<<新博新美商场购物退款单>>并签署确认章，消费者凭退款单到甲方商场财务室办理退款。乙方在甲方账户中货款金额大于消费者退款金额的，由甲方财务直接扣除；甲方在乙方货款中扣除甲方账户中货款小于消费者退款金额的，可由甲方垫支，乙方须在3日内向甲方补齐退还的金额，逾期未交纳的，甲方有权终止乙方经营(停电)，同时退款金额在乙方剩余市场管理费中扣除。',
          '8、甲方只对消费者退还收取的订金，乙方收取的尾款由乙方退还消费者。',
          '9、乙方办理消费者购物退款单笔金额超壹千元和一个月内累计退款超壹千元的，须商场总经理签字方可办理。乙方若出现恶意退单，甲方有权终止乙方经营。',
          '10、消费者购物由乙方向消费者开具发票。',
          '11、乙方办理返款单据遗失，需按甲方单据遗失程序办理。',
          '12、甲方商场财务室将在10日为乙方准备好办理返款所有手续，(节假日顺延)乙方若未来办理，甲方不承担拖延结款处罚。'
        ]
      }
    }
  };
</script>
<style lang="less" scoped>
  .three-tpl{
    .base-info{
      p{
        width: 100% !important;
      }
      p:last-child{
        text-indent: 2em;
      }
    }
  }
</style>
