<template>
  <div class="content-tpl two-tpl">
    <h4>新博新美连锁商场管理合同（权利义务篇）</h4>
    <div class="terms">
      <h5><span>第五条</span>关于合同付款逾期违约金的约定</h5>
      <div>
        乙方必须于合同约定付款日前一次性向甲方足额支付所有款项，先付后用。如乙方逾期未付或未足额支付时，双方约定：
        <p>
          （1）逾期在10日之内，乙方按日向甲方支付逾期应交款总额百分之五的违约金，并于实际支付应交款之日起次日内向甲方支付违约金，合同继续履行；
        </p>
        <p>
          （2）逾期在10-20日之内（含10日），乙方按日向甲方支付逾期应交款总额百分之十五的违约金，并于实际支付应交款之日起次日内向甲方支付违约金，合同继续履行；
        </p>
        <p>
          （3）逾期超过20日以上（含20日），甲方有权单方面解除合同，甲方有权无偿收回所经营场地，并追偿剩余欠款及本合同总金额百分之二十的违约金。
        </p>
      </div>
      <h5><span>第六条</span>权利和义务</h5>
      <div>
        （一）甲方的权利和义务
        <p v-for="item in aRightObligation" :key="item">{{item}}</p>
        <p>14、甲方
          <label>{{tplData.marketName}}</label> 店正式开业之日以甲方书面通知乙方为准，由甲方自行确定，乙方不得干涉，乙方对此不持任何异议且不得向甲方主张任何损失。
        </p>
        <p>15、法律、法规规定的甲方的其他权利和义务。</p>
      </div>
      <div>
        （二）乙方的权利和义务
        <div class="right-obligation">
          1、乙方经营产品类别
          <p><label>{{tplData.managementTypeName}}</label> 类</p>
          <p>
            <label>{{tplData.brandName}}</label> 品牌
            <label>{{tplData.agencyLevel}}</label> 代理级别
          </p>
          <p><label>{{tplData.managementTypeNamea}}</label> 类</p>
          <p>
            <label>{{tplData.brandNamea}}</label> 品牌
            <label>{{tplData.agencyLevela}}</label> 代理级别
          </p>
          <p><label>{{tplData.managementTypeNameb}}</label> 类</p>
          <p>
            <label>{{tplData.brandNameb}}</label> 品牌
            <label>{{tplData.agencyLevelb}}</label> 代理级别
          </p>
        </div>
        <p v-for="item in bRightObligation" :key="item" v-html="item"></p>
      </div>
      <h5><span>第七条</span>违约条款</h5>
      <div v-for="item in breakContract" :key="item.val">
        {{item.val}}
        <p v-if="item.sub" v-for="sub in item.sub" :key="sub">{{sub}}</p>
      </div>
      <h5><span>第八条</span>合同的续约</h5>
      <div v-for="(item,index) in renew" :key="item" :class="index === 0 || index === 2 ? 'important-info':''">
        {{item}}
      </div>
      <h5><span>第九条</span>解决争议的方式</h5>
      <div v-for="item in dispute" :key="item">
        {{item}}
      </div>
      <h5><span>第十条</span>合同附件</h5>
      <div v-for="item in annexe" :key="item">
        {{item}}
      </div>
      <h5><span>第十一条</span>其它约定</h5>
      <div class="important-info">1、本合同以上各项条款，甲方已提请乙方认真阅读，并向乙方进行了充分解释和说明，乙方对本合同条款真实含义清楚明了，并愿意按照本合同的约定，享有权利、履行义务。</div>
      <div class="important-info">2、对本商场的经营现况，已由甲方向乙方作出说明，乙方对该商场经营情况无异议。本合同经双方签字盖章后生效，合同一式二份，双方各执一份，具有同等法律效力。</div>
    </div>
    <div class="sign-info">
      <p>甲   方（盖章）</p>
      <p>乙   方（盖章）</p>
      <p>法定代表人/授权代表（签字）</p>
      <p>法定代表人/授权代表（签字）</p>
      <p>签约日期 <label>{{tplData.date}}</label></p>
    </div>
  </div>
</template>
<script>
  export default {
    props:['tplData'],
    data() {
      return {
        aRightObligation:[
          '1、甲方商场系开发建设，甲方为本商场的独家运营商。',
          '2、甲方负责配备商场公用设备、设施，并负责设备、设施的维护保养，保证其正常运转。',
          '3、甲方负责商场的日常经营管理，配备相应的管理人员对商场进行营销、安全、消防、保洁等经营管理服务工作。甲方有权委托专业公司承担本商业的专项管理与服务业务，但不得将整体管理责任转让给第三方。',
          '4、甲方保留不时制订、引进、修改、废除本商业任何规章制度，以达到经营和维持本商业作为优质家居商场的权利。上述规章制度作为本合同的补充，由甲方向乙方做出书面通知后即生效，乙方应予以遵守，但调整的规章制度不得侵犯乙方的合法权益。',
          '5、甲方在对商场房屋、设施、设备进行检查、维修时，有权借用乙方场地，（如时间较长，应与乙方协商）。由于商场需配合上级行政主管部门对消防、水电管线等设施设备等进行进一步整改完善，期间商场在接到上级主管部门通知后会采取停电、停水及停业等措施，乙方须按照商场的统一管理配合各项检查工作。',
          '6、合同期内，甲方为乙方有偿提供水电安装和检修服务，其材料费和维修费由乙方承担。',
          '7、甲方为乙方提供公用照明、客货直升电梯、自动扶梯等公共服务，甲方有权向乙方收取相关使用费用。',
          '8、甲方负责商场对外整体广告及促销活动策划及实施，有偿提供商场营销活动宣传。',
          '9、甲方在本合同期满前二个月内向乙方发续签通知，乙方应在收到通知之日起15日内给予回复，否则，甲方有权带领新商户进场考察。',
          '10、甲方依照合同约定维系商场正常经营管理秩序，保证乙方在合同期内的使用权，乙方不得因本商场可能存在的瑕疵向甲方主张任何赔偿的权利。',
          '11、甲方可在不损害他人合法权益及社会公共权益的前提下，按照双方约定或协商确定费用，向乙方提供本合同约定以外的服务项目。',
          '12、甲方对乙方及其雇员和顾客违反物业管理法规政策、本商场相关管理规定及本合同的行为进行处理，包括但不限于责令停止违法、违规行为，在规定时限内恢复原状，要求乙方承担违约赔偿责任及支付违约金，对不按时足额缴/交纳有关费用或拒不改正违章行为者，有权依法中止或停止提供商业管理服务（包括但不限于安防、保洁、空调、货品出入、照明、停车、供暖、供水、供电等），并采取符合本合同约定的催交、催改措施。',
          '13、如乙方工作人员因服务态度不佳被顾客投诉，经甲方调查情况属实，甲方有权要求乙方立即整改，包括更换该工作人员。如乙方因服务态度和商品质量问题被顾客在一个月内至商业服务台投诉达3次以上，甲方有权要求乙方停业整顿，停业期间仍应交纳租金等各项费用，因此造成的所有损失由乙方自行承担。',
        ],
        bRightObligation:[
          '2、合同期内乙方经营商品为家具、建材、装饰材料，所经营的品类、品牌必须符合上述第一款的约定，乙方不得擅自改变所经营的产品类别及品种，乙方需更改或增加经营品牌，应得到甲方书面同意，若乙方擅自改变所经营的产品类别或增加经营品牌，属乙方违约，甲方将书面通知乙方限期改正。若乙方限期不改，甲方有权单方解除本合同并无偿收回场地使用权，要求乙方限期撤场，同时乙方仍需补齐的本合同约定的所有费用及乙方已缴纳的各项费用全部作为违约金，甲方不予退还。',
          '3、乙方须在进场经营时提供符合公司要求的如下材料：营业执照、税务登记证（若已办理三证合一后的营业执照，则无需提供此项）、注册商标证书、产品检测报告、产品厂家授权书、资质证书、法定代表人身份证、委托代理人身份证、授权委托书等资料的复印件。',
          '4、乙方必须参加由甲方统一出面投保的商场财产保险和公共安全责任险，保险费用由乙方承担。如因乙方未办理保险或未缴纳保险费用所发生的意外事故概由乙方自行承担。',
          '5、乙方对经营场地进行装修时，应遵守国家有关消防安全、装饰、装修管理等法律法规及甲方制定的有关装饰、装修管理规定，装修前乙方须将装修效果图和施工方案报甲方审批通过，并与甲方签订《新博新美连锁商家装修管理协议》后方可施工。若乙方未按甲方审核的施工方案装修，甲方给予乙方整改期限，乙方在整改期限内未按甲方要求完成整改或拒绝整改的，甲方有权解除合同，无偿收回所经营场地，一切损失由乙方自行承担。',
          '6、乙方未经政府及甲方批准，不得以任何形式改变、损害本商业原有建筑主体结构和消防分隔等设施；不得以任何理由占用、损坏本商业的公共区域、共用部位、共用设施设备或改变其使用功能。因搬迁、装饰、装修等原因确需使用共用部位、共用设施设备的，乙方应事前书面申请，经甲方批准后方可在甲方监督下合理使用，并在约定的期限内恢复原状，造成损失的，乙方予甲方赔偿。',
          '7、乙方应按时向甲方支付由甲方已经代付的水电费、燃气费或其他代收、代缴费用，若逾期不支付，甲方有权停水停电或停止其他付费服务。',
          '8、乙方在经营期间，应自觉维护商场的一切设施、设备，如因乙方疏忽或故意导致商场设施设备的损毁等，所造成的一切人身安全责任和经济损失由乙方负责。',
          '9、乙方不得将经营场地转租给第三方，未经甲方书面同意，转租协议无效，并构成乙方违约。甲方有权收回经营场地，同时有权要求第三方三日内撤场，一切损失由乙方及第三方自行承担，与甲方无关。',
          '10、乙方须在经营场地装修完成后（具体时间以装修协议约定为准）七日内达到正常经营状态（新商场达到正常经营状态时间可以与商场开业时间一致），如连续十日空场或连续三日无营业员上班或关闭经营场地，甲方有权通知乙方按甲方要求整改，通知发出后三日内乙方未整改或整改不符合甲方要求的，甲方有权单方解除本合同，收回经营场地，并要求乙方三日内退场，乙方所交费用作为违约金不予退还。',
          '11、乙方在日常经营过程中必须遵守甲方的各项规章制度并服从甲方的管理，否则甲方将对乙方实施罚款处理，情节严重者，甲方有权单方解除本合同并收回乙方经营场地。',
          '12、乙方自主经营，对外独立承担民事及经济责任。乙方在合同期内必须遵守国家法律、法规合法经营，若因违法经营给甲方造成名誉或经济等损失，甲方保留对乙方追诉赔偿的权利。',
          '13、乙方在甲方商场内发布的各类广告、宣传资料必须符合广告法等法律法规，并经甲方审核通过后才能发布，如乙方发布的各类广告、宣传资料对甲方或第三方造成不良影响的一切责任由乙方承担。',
          '14、乙方销售的商品质量，必须符合国家法律法规要求，严禁销售假冒伪劣及侵权产品，一经发现，甲方有权要求乙方停止销售，若因乙方的违法行为给甲方造成名誉或经济等损失，甲方保留对乙方追诉赔偿的权利。',
          `15、乙方应服从本商场统一营业时间安排。在租赁期间内，甲方可以根据实际情况，合理调整营业时间。甲方有权按情况需要提前通知乙方后修改营业时间，乙方必须遵守，不得异议。
          <br/>
          在本商场正常营业的时间内，乙方应自行承担费用使承租商铺营业标志、标识、店面和窗户保持照明；正常营业时间外使用的，乙方应向甲方申请。为达到理想的照明效果，乙方应允许甲方控制该商铺的营业标志、标识、店面及窗户的电路。
          <br/>
          对于营业时间外产生的额外服务费用，例如，空调、电梯、公共区域照明、厕所的延时使用等造成的甲方额外的设施设备能耗和人员加班费用等，需由乙方另行承担和支付费用，具体费用由甲方根据实际计量和计算的结果另行通知乙方，乙方应按甲方的交费通知按时足额支付，否则应根据本合同约定承担违约责任。`,
          '16、乙方应按照安全、公平、合理的原则，正确处理本商场的给排水、通风、采光、维修、通行、卫生、环保等方面的相邻关系，不得侵害他人的合法权益，否则，由此产生的一切责任均由乙方承担。',
          '17、乙方未经甲方书面同意不得将任何物件（包括标牌、广告牌等）安装、张挂在外墙和公共部位的墙壁上，不得利用商业从事非法活动，不得将易燃、易爆、剧毒、放射性等物品带入、存放在本商场内；在铺内设立仓库、办公室或货品堆放处，需要按照消防要求安装烟感、喷淋、防爆灯，商铺内货架必须符合消防要求。',
          '18、乙方在对商品价格展示时，必须使用由甲方统一印制或经物价部门审核通过的商品标价签和活动促销牌，相关费用在乙方每年交纳的“运营杂费”中扣除。乙方必须对商品售价及各类促销售价的真实性负责，并承担赔偿由于乙方价格不实对甲方造成的一切损失。',
          '19、乙方在合同期内，若因商品质量、价格、售后服务问题发生消费者投诉三次以上，或一次以上媒体曝光，并造成甲方、新博新美品牌及场内商家名誉受损，甲方有权单方解除本合同，收回乙方所经营场地，乙方缴纳的所有费用不予退还，同时甲方保留对乙方追诉的权利。',
          '20、乙方应负责赔偿其营业员、顾客等违反本商场各项管理规定造成的损失；负责教育、监管其成员、代理人、雇员或其他使用者遵守服从本协议和其他有关规定，对于上述人员与本承租商品有关的任何违约或侵权行为，除当事人承担法律责任外，乙方承担连带责任。',
          '21、乙方应根据甲方规定的时间、路线、方式运输货物和各类垃圾（包括餐厨垃圾、装修垃圾等）的清理；货物需在甲方指定的卸货区装卸；乙方营业产生的各类垃圾必须袋装，干湿分开，并按甲方规定时间由乙方自行运送至甲方指定的垃圾房，由甲方代为管理清运；乙方应按甲方及政府有关规定付费；乙方若有特殊需求，需与甲方协商，并以书面方式确认。',
          '22、乙方不得在本商场任何进出口、楼梯、平台、通道、大堂或其他公共区域铺设、安装、树立、附加任何电线、电缆或其他物件，不得阻占消防通道、消防卷帘门及安全出口，亦不得将货品或其他任何物体摆设或堆放在承租商铺之外。',
          '23、在承租商铺使用过程中，乙方承诺不放置任何超过该商铺建筑设计荷载的物品。',
          '24、未经甲方书面同意，乙方不得在本商场范围内的屋顶、天花板、墙壁等地方安装任何天线、接收器、管道、附属物、遮阳物、凉棚或其他任何类型、性质的安装物和附属物。',
          '25、乙方不得破坏、损毁或涂污本商场结构的任何部分，或本商业的公共区域、楼梯、电梯、自动楼梯的任何装饰外貌，包括本商场内的任何树木、植物及灌木。',
          '26、乙方在任何情形下，不得以客户电梯或电动扶梯作运货用途，乙方不得在本商业的任何电梯内放置任何重量超过该电梯的最大载重的物件。',
          '27、除根据商铺租赁合同或本协议定的用途使用该商铺生产、制造或加工物品外，乙方不得在该商铺生产、制造或加工任何货物或商品。',
          '28、乙方不得在该商铺内居住或容许他人居住。',
          '29、不论甲方在本商业内设置保安人员或安装电子防盗系统与否，甲方对承租商铺及其内部财产及人员不负任何保安及保管责任。乙方应负责该商铺内人员及财产的安全。',
          '30、甲乙双方终止合同后，在不损坏公共区域装修的前提下，乙方有义务在本合同结束后的7日内对所经营场地的内部装修进行拆除，并负责清运拆除的杂物。未形成附合的装饰装修物，乙方未按上述要求清理，甲方将在乙方剩余费用中扣除用于场地清理的费用，剩余费用不足以抵扣的，甲方有权向乙方追偿。已形成附合的装饰装修物，归甲方所有。',
          '31、乙方经营商品售后服务应按双方签订的《新博新美连锁商品售后服务协议》(详见附件2)执行。',
          '32、乙方经营商品的价格应按双方签订的《新博新美连锁商品价格管理协议》（详见附件4）执行。',
          '33、乙方应遵守本商场消防安全管理规定，需同甲方签订《新博新美连锁商场消防及安全责任书》详见附件1）作为本合同附件。同时，乙方作为其经营区内消防治安安全责任人，实行“谁经营、谁负责”的原则，乙方承担商铺经营相关的消防责任，积极参与、配合甲方组织的消防培训和演练，并对其使用区域内的灭火器等消防安防器具、设施进行维护，按政府相关部门要求进行检测，保证能够正常使用；若因乙方维护不当或未及时检测，导致消防设备设施无法正常使用而造成损失的，则应由乙方承担赔偿责任。',
          '34、对于乙方违反法律规定或未经甲方的同意或违反本商业相关管理规定而设置招牌和广告，或者乙方拒绝对出现毁损或渗漏现象的招牌、广告予以维修或更换的，则甲方或物业管理公司有权直接予以拆除，并完成相关的墙面等的复原工作，因此而发生的费用或损失均由乙方承担。',
          '35、法律法规规定的乙方的其它权利和义务。'
        ],
        breakContract:[
          {'val':'1、甲、乙双方在有充分证据证明对方不履行或违反本合同的任何条款，均由违约方承担相应的违约责任，并赔偿因违约行为给对方造成的全部损失。'},
          {'val':'2、乙方若未按时交清合同款，属乙方违约：相关约定参照本合同第四条《关于合同付款逾期违约金的约定》执行。'},
          {'val':'3、在合同期限内，若乙方擅自撤场或提出撤场，则视为乙方单方面解除合同，甲方有权无偿收回场地，乙方所交费用不予退还并必须补齐本合同期内所欠剩余场商铺租金，同时乙方应向甲方支付本合同费用总额的百分之二十的违约金并赔偿因违约行为给甲方造成的全部损失。'},
          {'val':'4、在合同期期限内，乙方不得向第三方转租或抵押本合同中租赁商铺及相关权利，否则属乙方违约，甲方有权单方解除本合同，无偿收回场地，乙方所交费用不予退还并必须补齐本合同期内所欠剩余场商铺租金，同时乙方应向甲方支付本合同费用总额的百分之二十的违约金并赔偿因违约行为给甲方造成的全部损失。'},
          {'val':'5、本合同的签订系甲乙双方真实意思表示，双方不存在欺诈、胁迫、显失公平等情形。若乙方对本商场可能存在的瑕疵采取包括诉讼在内的方式追究甲方的责任，则视为乙方根本违约，甲方可解除本合同，无偿收回营业场地并有权要求乙方赔偿损失。'},
          {'val':'6、无论何种原因导致合同无效、被撤销或合同解除、合同期满的，乙方应在上述事项确认或发生之后的7日内办理退租手续，并腾退商铺；若乙方未在上述期限内腾退商铺的，甲方有权按照本合同约定收取场地超期占用费，同时甲方有权停止对商铺或商场进行水电气等供给，并关闭商场或停止各种服务，由此造成的一切损失由乙方承担。'},
          {
            'val':'7、双方确定，甲方无需就以下原因所致损害承担责任',
            'sub':[
              '（1）因不可抗力导致的服务中断或租赁商铺价值的贬损；',
              '（2）因租赁商铺本身固有瑕疵造成的损害；',
              '（3）因维修、养护共用部位、共用设施设备需要而临时停水、停电或停止共用设施设备的使用；',
              '（4）非因甲方责任造成的供水、供电、空调、通讯、有线电视及其他公用设施设备的中断、障碍及损失；',
              '（5）乙方责任致使甲方无法完成商业管理服务或达不到服务标准；',
              '（6）经本租赁商铺业主同意的工程改造或商铺调整导致的损害。',
              '（7）非因甲方原因造成本租赁商铺所有人、使用人、第三人人身、财产损害的。'
            ]
          },
        ],
        renew:[
          '1、在乙方合同到期前二个月内，甲方可根据乙方合同的履行情况，酌情考虑是否续约。若甲方决定续约的，应向乙方发出《新博新美连锁续签通知单》，乙方在收到《新博新美连锁续签通知单》后在通知单约定的时间内应向甲方确认是否续签，若乙方确认续签，则应在合同到期前一个月内办理合同续签等相关手续，若未按期办理续签手续，则视为乙方放弃续租，甲方有权对该场地另行处理同时收取一个月的商铺租金作为违约金。',
          '2、甲方决定不再续约未发出续约通知单的或乙方若在接到通知后未在通知单约定的时间内回执确认的，合同不再续约，乙方应按合同要求及时办理退租手续并腾退商铺。',
          '3、合同期满乙方继续占用甲方场地，超期五日内（含）应支付甲方场地超期占用费100元∕㎡∕天；超期五日以上的，乙方支付甲方场地超期占用费200元∕㎡∕天，甲方有权收回场地，同时处理乙方店面内的所有物品；乙方承诺赔偿因超期给甲方造成的一切损失。',
          '4、合同期满或被解除后，乙方在七日后还未将所属物品全部搬离场地和撤除装修，即被视为已经放弃其对该物品的所有权，且视为已授权甲方处置该物品。乙方应承担甲方为清除上述物品发生的费用。',
          '5、本合同到期或提前解除时，乙方无权要求甲方赔偿因装修该经营场地而发生的费用，以及进场经营期间的各项费用。'
        ],
        dispute:[
          '1、本合同适用中华人民共和国法律，本合同有关一切争议，甲、乙双方都应尽量通过友好协商解决。如因协商达不成一致，任何一方可向甲方所在地有管辖权的法院起诉，因此产生的所有费用（包括但不限于诉讼费、公证费、保全费、鉴定费、律师费等）由违约方承担。在诉讼过程中，除双方有争议正在进行诉讼的部分外，本合同应继续履行，一切有关合同的各种费用均由甲、乙双方按规定各自承担。',
          '2、合同期内，如因不可抗力，如：发生自然灾害、战争、暴乱等导致本合同不能履行，本合同自动终止，由此产生的财物损毁，甲、乙双方均不承担违约责任。',
          '3、凡因国家政策、法律法规的变动和要求，致使本合同无法履行，甲、乙双方均不承担违约责任。'
        ],
        annexe:[
          '（1）《新博新美连锁商场消防及安全责任书》',
          '（2）《新博新美连锁商品售后服务协议》',
          '（3）《新博新美连锁营业员管理协议》',
          '（4）《新博新美连锁商品价格保护协议》',
          '（5）《新博新美连锁商场统一收款合同》',
          '（6）《新博新美连锁反商业贿赂协议》',
          '以上协议作为合同附件与合同正本具有同一的法律效力。'
        ]
      }
    },
    methods: {

    }
  };
</script>
<style lang="less" scoped>
  .two-tpl{
    .right-obligation{
      padding-left: 20px;
      p{
        width: 100% !important;
        display: block !important;
        float: none !important;
        margin: 3px 0;
      }
    }
  }
</style>
